programming/20220606215022-emacs_lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Lisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Emacs Lisp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdfdbae3">Emacs Lisp</a>
<ul>
<li><a href="#org2e39515">Values</a></li>
<li><a href="#org86cbbf8">Eval/Form</a></li>
<li><a href="#org5857d9e">Symbols</a></li>
<li><a href="#org51854e6">Prefix v infix</a></li>
<li><a href="#orgcc6d114">Error Handling</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfdbae3" class="outline-2">
<h2 id="orgdfdbae3">Emacs Lisp</h2>
<div class="outline-text-2" id="text-orgdfdbae3">
<p>
Emacs lisp a lisp dialect for confguring Emacs.
Much of emacs is written in elisp, with some of it in C.
</p>
</div>

<div id="outline-container-org2e39515" class="outline-3">
<h3 id="org2e39515">Values</h3>
<div class="outline-text-3" id="text-org2e39515">
<p>
Any value or object has a type. it may not always be readable
</p>

<p>
There are differnt types in elisp
</p>
<ul class="org-ul">
<li>String</li>
<li>Numbers (iteger and float)</li>
<li>Con cells</li>
<li>Arrays/vectors</li>
<li>Many more</li>
</ul>

<p>
There are also types that are specific to emacs lisp.
</p>

<ul class="org-ul">
<li>Buffers</li>
<li>Windows</li>
<li>Frames</li>
<li>Threads</li>
<li>Keymaps</li>
<li>And more</li>
</ul>
</div>
</div>


<div id="outline-container-org86cbbf8" class="outline-3">
<h3 id="org86cbbf8">Eval/Form</h3>
<div class="outline-text-3" id="text-org86cbbf8">
<p>
A form is any value that you can evaluate.
Some examples
</p>
<ul class="org-ul">
<li>lists</li>
<li>Symbol</li>
<li>Other types</li>
</ul>

<p>
Code Examples
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">[ 1 2 (+ 3 4)]
</pre>
</div>
</div>
</div>

<div id="outline-container-org5857d9e" class="outline-3">
<h3 id="org5857d9e">Symbols</h3>
<div class="outline-text-3" id="text-org5857d9e">
<p>
A symbol is a object, but does not self eval
A symbol can contail alpha-numeric charecters but others.
When a symbol is evaluated the value is returned with the binding.
</p>
</div>
</div>

<div id="outline-container-org51854e6" class="outline-3">
<h3 id="org51854e6">Prefix v infix</h3>
<div class="outline-text-3" id="text-org51854e6">
<p>
Lisp uses prefix notation.
Any expesion that does a function eval, the first element is a function.
</p>
</div>
</div>

<div id="outline-container-orgcc6d114" class="outline-3">
<h3 id="orgcc6d114">Error Handling</h3>
<div class="outline-text-3" id="text-orgcc6d114">
<ul class="org-ul">
<li><a href="20230327155154-elisp_errors.html#ID-f284c2d8-6777-4ff5-94e1-a928628810d4">elisp errors</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
